[
    {
              "empName": "Thursday Thrift Inc.",
              "position": "Lead Software Developer",
              "description": "->Spearhead cross-platform full-stack development using React, Tailwind CSS, TypeScript, Flutter, FastAPI, Prisma, Nest.js and PostgreSQL, improving delivery efficiency across 3 teams by 40% (measured over 8 weeks).\n->Architected and operated a Claude-powered MCP backend layer, integrating modern AI/LLM tooling to enforce ORM safety checks, reduce high-risk DB actions by 55%, and improve long-term maintainability.\n->Refactored 30+ API endpoints and database schemas for scalability, performance optimization, and metadata efficiency, improving system reliability for production workloads.\n->Built interactive dashboards with TypeScript, MaterialUI, and React, enabling real-time data visualization and reducing UI latency by 30%\n->Deployed frontend to Vercel and backend to Railway using Docker, enabling full-stack delivery with Git CI/CD, API integration, and environment variable management across platforms.",
              "period": "Jun 2025 - Present"
            
          
    },
    {
              "empName": "CASE CO-OP @ Syracuse University (in Partnership with Toyz Electronics)",
              "position": "Software Engineer Intern",
              "description": "->Refactored 10+ PlayFab RESTful APIs to reduce data retrieval time by 45%, resulting in smoother course registration and updating of 10K+ users\n->Designed and deployed Oli-Torus (course platform) using React, Next.js, Typescript, and AWS EC2/S3, linking it to Toyz-application and enabling scalable and secure student-tutor interactions\n->Strengthened platform data integrity by developing Azure HTTP trigger functions in C# to sync user metadata and publish user-generated content to the PlayFab Marketplace across web and Unity platforms.\n->Built interactive dashboards with TypeScript, MaterialUI, and React, enabling real-time data visualization and reducing UI latency by 30%\n->Implemented Cypress and React Testing Library for integration testing, ensuring consistent quality across 20+ frontend and API features\n->Contributed to the implementation of Agile methodology using JIRA for sprint management, utilizing Git with CI/CD pipelines for version control, resolving merge conflicts, and cherry-picking commits\n->Integrated OpenAI API with Microsoft PlayFab to deliver personalized career path recommendations based on user data, enhancing student engagement by ~30%.",
              "period": "May 2024 - May 2025"
            
          
    },
    {
              "empName": "iConsult Collaborative at Syracuse University",
              "position": "Web Developer, Syracuse, NY",
              "period": "Aug 2023 – Aug 2024",
              "description": "->Developed 10+ responsive UI components using React and SCSS, improving mobile usability and enhancing cross-platform performance\n->Reviewed PRs and optimized frontend logic for 4 junior developers, leading to faster QA approvals and smoother feature rollouts\n->Collaborated with cross-functional teams and clients to design modular UI layouts, improving team efficiency in feature delivery by 17%\n->Integrated RESTful APIs and microservices to enhance dynamic data fetching, improving page load speeds and reducing bounce rates on key screens"
    },
        {
            "empName": "Bosch Global Software Technologies",
            "position": "Associate Software Engineer, Bangalore, India",
            "period": "Jul 2022 – Jul 2023",
            "description": "->Engineered microservices and frontend modules for the Bosch Spare Tools platform using Angular, TypeScript, Spring Boot, and SCSS, driving adoption across multiple B2B enterprise clients.\n->Streamlined integration testing workflows by automating regression suites and optimizing test data pipelines, doubling execution speed and cutting deployment cycles from 10 days to 5."
          }

]
  