[
    {
              "empName": "Thursday Thrift Inc.",
              "position": "Lead Software Engineer",
              "description": "● Engineered a scalable full-stack system using FAST API and Prisma ORM (Python) for the backend, Next.js, TypeScript, and React for the frontend, PostgreSQL as the database, and AWS S3 for asset storage; implemented Git CI/CD and deployed on Vercel and Railway, developing onboarding features for 100+ thrift stores across the U.S. and achieving 90% user satisfaction on initial release.\n● Elevated user experience for Thursday Thrift App users by introducing intuitive swipe-based interactions for item discovery, increasing engagement and session duration by over 40%.\n ● Designed and implemented an AI-driven personalization system using user interactions (swipes, likes, and views) with K-Means clustering and item-to-item collaborative filtering to deliver tailored recommendations, improving match accuracy and user retention by 60%.",
              "period": "Jun 2025 - Present",
              "eImage": "/THLOGO.png"
            
          
    },
    {
              "empName": "CASE CO-OP @ Syracuse University (in Partnership with Toyz Electronics)",
              "position": "Software Engineer Intern",
              "description": "● Enhanced user experience for 15,000+ users by refining the UI in a React web app and Unity game, resolved key bugs and introduced seamless profile update and content viewing features, resulting in smoother navigation and a 30% increase in session retention.\n● Integrated the OpenAI API with Microsoft PlayFab’s UGC content to recommend personalized career paths for students, leveraging optimized semantic-prompting templates with response caching to minimize latency and deliver efficient, context-aware recommendations.\n● Strengthened data integrity by developing HTTP trigger functions with Azure Functions to synchronize user data and publish user-created content to Microsoft PlayFab’s marketplace across multiple platforms.\n● Refactored 30+ API calls to optimize performance and eliminate 429 rate-limit errors by offloading heavy gameplay analytics to Snowflake, reducing API failure rates by 60% and query latency by 45%; built scalable dashboards delivering engagement and progress metrics for investors, mentors, and stakeholders.",
              "period": "May 2024 - May 2025",
               "eImage": "/Case.jpeg"
            
          
    },
    {
              "empName": "iConsult Collaborative at Syracuse University",
              "position": "Web Developer, Syracuse, NY",
              "period": "Nov 2024 – Aug 2024",
              "eImage": "iConsult.jpeg",
              "description": "● Designed, fine-tuned, and deployed a GPT-3.5-Turbo-0125–based bias classification system using scalable embeddings and Spark-optimized data pipelines, reducing preprocessing time by 30% and re-learning overhead by 40%.\n● Led end-to-end development of a production-ready NLP model achieving real-time bias detection with latency under 100 ms, improving user interaction efficiency by 15% through secure, scalable system design and deployment practices."
    },
        {
            "empName": "Bosch Global Software Technologies",
            "position": " Software Engineer, Bangalore, India",
            "period": "Jul 2022 – Jul 2023",
            "eImage": "./bosch.jpeg",
            "description": "● Developed microservices and test automation for Bosch platform using Angular, JavaScript, and Spring Boot supporting 60K+ products.\n● Researched, presented, and prototyped applications of Deep Q-Networks based Reinforcement Learning with RFID integration in efforts to optimize Bosch Spare Tools supply chain."
          }

]
  